Revit 2027 API
BuiltInFailures.RoomFailures.RoomsReallyFailed Property
 [Room] computations failed. Try to modify the following elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomsReallyFailed { get; }
Public Shared ReadOnly Property RoomsReallyFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomsReallyFailed {
	FailureDefinitionId^ get ();
}
static member RoomsReallyFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace